import type { Metadata } from 'next';

export const metadata: Metadata = {
  title: 'طريق الخير للنظافة والصيانة | الدمام',
  description: 'أفضل شركة تنظيف بالدمام. خدمات غسيل الكنب والسجاد، تلميع الرخام، تنظيف المنازل والفلل، مكافحة حشرات. خدمة احترافية بأسعار منافسة',
  keywords: [
    'شركة تنظيف',
    'أفضل شركة تنظيف',
    'طريق الخير للنظافة',
    'تنظيف منازل',
    'غسيل الكنب والسجاد',
    'تلميع الرخام',
    'جلي الرخام',
    'تنظيف فلل',
    'تنظيف دبلكس',
    'غسيل بطانيات',
    'تنظيف خزانات المياه',
    'تعقيم خزانات المياه',
    'مكافحة الحشرات',
    'تنظيف بخار',
    'تنظيف الدمام',
    'تنظيف الخبر',
    'تنظيف القطيف',
    'تنظيف سيهات',
    'تنظيف الأحساء',
    'خدمات التنظيف',
    'شركة غسيل',
    'تنظيف بعد التشطيب',
    'تشطيب منازل'
  ],
  openGraph: {
    title: 'طريق الخير للنظافة والصيانة | الدمام',
    description: 'أفضل شركة تنظيف بالدمام. خدمات غسيل الكنب والسجاد، تلميع الرخام، تنظيف المنازل والفلل، مكافحة حشرات. خدمة احترافية بأسعار منافسة',
    type: 'website',
    locale: 'ar_SA',
    url: 'https://tareqalkhayr.sa/',
  },
  twitter: {
    card: 'summary_large_image',
    title: 'طريق الخير للنظافة والصيانة | الدمام',
    description: 'أفضل شركة تنظيف بالدمام. خدمات غسيل الكنب والسجاد، تلميع الرخام، تنظيف المنازل والفلل، مكافحة حشرات. خدمة احترافية بأسعار منافسة',
  },
};